MyoMod/MyoMod-DPU/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitDEBUG_UART();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D8, peripheral: GPIO2, signal: 'gpio_io, 03', pin_signal: GPIO_B0_03}
  - {pin_num: J11, peripheral: LPI2C1, signal: SCL, pin_signal: GPIO_AD_B1_00, software_input_on: Enable, open_drain: Enable}
  - {pin_num: K11, peripheral: LPI2C1, signal: SDA, pin_signal: GPIO_AD_B1_01, software_input_on: Enable, open_drain: Enable}
  - {pin_num: J12, peripheral: LPI2C3, signal: SDA, pin_signal: GPIO_AD_B1_06, software_input_on: Enable, open_drain: Enable}
  - {pin_num: K10, peripheral: LPI2C3, signal: SCL, pin_signal: GPIO_AD_B1_07, software_input_on: Enable, open_drain: Enable}
  - {pin_num: M12, peripheral: GPIO1, signal: 'gpio_io, 19', pin_signal: GPIO_AD_B1_03}
  - {pin_num: K14, peripheral: LPI2C4, signal: SCL, pin_signal: GPIO_AD_B0_12, identifier: SCL4, software_input_on: Enable, open_drain: Enable}
  - {pin_num: L14, peripheral: LPI2C4, signal: SDA, pin_signal: GPIO_AD_B0_13, identifier: SDA4, software_input_on: Enable, open_drain: Enable}
  - {pin_num: F2, peripheral: GPIO4, signal: 'gpio_io, 04', pin_signal: GPIO_EMC_04, identifier: SW_UP, direction: INPUT, pull_up_down_config: Pull_Up_47K_Ohm, pull_keeper_select: Pull}
  - {pin_num: H3, peripheral: GPIO4, signal: 'gpio_io, 08', pin_signal: GPIO_EMC_08, identifier: SW_MOD, direction: INPUT, pull_up_down_config: Pull_Up_47K_Ohm, pull_keeper_select: Pull}
  - {pin_num: G5, peripheral: GPIO4, signal: 'gpio_io, 05', pin_signal: GPIO_EMC_05, identifier: SW_DOWN, direction: INPUT, pull_up_down_config: Pull_Up_47K_Ohm,
    pull_keeper_select: Pull}
  - {pin_num: H5, peripheral: GPIO4, signal: 'gpio_io, 06', pin_signal: GPIO_EMC_06, identifier: SW_RESET, direction: INPUT, gpio_interrupt: kGPIO_IntFallingEdge,
    pull_up_down_config: Pull_Up_47K_Ohm, pull_keeper_select: Pull}
  - {pin_num: C5, peripheral: GPIO4, signal: 'gpio_io, 31', pin_signal: GPIO_EMC_31, identifier: DEBUG1, direction: OUTPUT}
  - {pin_num: E4, peripheral: GPIO3, signal: 'gpio_io, 23', pin_signal: GPIO_EMC_37, identifier: DEBUG2, direction: OUTPUT}
  - {pin_num: C3, peripheral: GPIO3, signal: 'gpio_io, 22', pin_signal: GPIO_EMC_36, direction: OUTPUT}
  - {pin_num: C10, peripheral: GPIO2, signal: 'gpio_io, 12', pin_signal: GPIO_B0_12, direction: OUTPUT}
  - {pin_num: D9, peripheral: GPIO2, signal: 'gpio_io, 10', pin_signal: GPIO_B0_10, identifier: RGB_R, direction: OUTPUT}
  - {pin_num: B11, peripheral: GPIO2, signal: 'gpio_io, 17', pin_signal: GPIO_B1_01, identifier: RGB_G, direction: OUTPUT}
  - {pin_num: A11, peripheral: GPIO2, signal: 'gpio_io, 16', pin_signal: GPIO_B1_00, identifier: RGB_GND, direction: OUTPUT}
  - {pin_num: A10, peripheral: GPIO2, signal: 'gpio_io, 11', pin_signal: GPIO_B0_11, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           

  /* GPIO configuration of RGB_R on GPIO_B0_10 (pin D9) */
  gpio_pin_config_t RGB_R_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_10 (pin D9) */
  GPIO_PinInit(GPIO2, 10U, &RGB_R_config);

  /* GPIO configuration of RGB_B on GPIO_B0_11 (pin A10) */
  gpio_pin_config_t RGB_B_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_11 (pin A10) */
  GPIO_PinInit(GPIO2, 11U, &RGB_B_config);

  /* GPIO configuration of DEBUG4 on GPIO_B0_12 (pin C10) */
  gpio_pin_config_t DEBUG4_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B0_12 (pin C10) */
  GPIO_PinInit(GPIO2, 12U, &DEBUG4_config);

  /* GPIO configuration of RGB_GND on GPIO_B1_00 (pin A11) */
  gpio_pin_config_t RGB_GND_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_00 (pin A11) */
  GPIO_PinInit(GPIO2, 16U, &RGB_GND_config);

  /* GPIO configuration of RGB_G on GPIO_B1_01 (pin B11) */
  gpio_pin_config_t RGB_G_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_B1_01 (pin B11) */
  GPIO_PinInit(GPIO2, 17U, &RGB_G_config);

  /* GPIO configuration of DEBUG3 on GPIO_EMC_36 (pin C3) */
  gpio_pin_config_t DEBUG3_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_36 (pin C3) */
  GPIO_PinInit(GPIO3, 22U, &DEBUG3_config);

  /* GPIO configuration of DEBUG2 on GPIO_EMC_37 (pin E4) */
  gpio_pin_config_t DEBUG2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_37 (pin E4) */
  GPIO_PinInit(GPIO3, 23U, &DEBUG2_config);

  /* GPIO configuration of SW_UP on GPIO_EMC_04 (pin F2) */
  gpio_pin_config_t SW_UP_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_04 (pin F2) */
  GPIO_PinInit(GPIO4, 4U, &SW_UP_config);

  /* GPIO configuration of SW_DOWN on GPIO_EMC_05 (pin G5) */
  gpio_pin_config_t SW_DOWN_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_05 (pin G5) */
  GPIO_PinInit(GPIO4, 5U, &SW_DOWN_config);

  /* GPIO configuration of SW_RESET on GPIO_EMC_06 (pin H5) */
  gpio_pin_config_t SW_RESET_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_IntFallingEdge
  };
  /* Initialize GPIO functionality on GPIO_EMC_06 (pin H5) */
  GPIO_PinInit(GPIO4, 6U, &SW_RESET_config);
  /* Enable GPIO pin interrupt on GPIO_EMC_06 (pin H5) */
  GPIO_PortEnableInterrupts(GPIO4, 1U << 6U);

